#!/usr/bin/env python3
# ธีรภัทร์ นิลศิริ
# 640510662
# Lab 06
# Problem 5
# 204111 Sec 002

def longest_digit_run(n):
    #117777771111
    count = 1 #นับตัวแรก
    max_ = 1 #เก็บจำนวนเลขซ้ำที่ติดกันที่มากที่สุด
    repeat = 1 #นับว่ามีตัวซ้ำกี่ตัว

    #====1st Round====#
    n1=n%10 #เก็บตัวท้ายสุด
    n=n//10 #ตัดตัวท้ายสุด (คัดออกหลังจากนับไปแล้ว)
    #print(n1)
    count = n1 #ตัวแรก

    #====2nd Round====#
    while n > 0: #คิดจนกว่าจะครบทุกตัว จากขวาไปซ้าย # 111177711 ===> 1 <- 1 <- 1 <- 1 <- 7 <- 7 <- 7 <- 1 <- 1 
        n1=n%10 #เก็บตัวท้ายสุด
        n=n//10 #ตัดตัวท้ายสุด (คัดออกหลังจากนับไปแล้ว)
        #print(n1)
        if count == n1: #ถ้าเลขตัวถัดไปเหมือนกับตัวก่อนหน้า
            repeat += 1 #นับว่ามีตัวซ้ำกี่ตัว
            if repeat > max_: #เก็บค่าเยอะสุด
                max_ = repeat  #เก็บค่าตัวที่ซ้ำติดกันเยอะสุด

        else: #ถ้าเลขตัวถัดไปไม่เหมือนกับตัวก่อนหน้า ให้เริ่มเก็บค่าใหม่
            repeat = 1 #เริ่มเก็บค่าใหม่ตัวซ้ำกันจะเริ่มนับ 1 ใหม่
            count = n1 #เริ่มเก็บค่าใหม่ถ้าตัวต่อมาไม่ซ้ำกับตัวเก่า
    return (max_) #คืนค่าตัวเลขซ้ำที่ติดกันมากที่สุด

def main():
    n = int(input())
    print(longest_digit_run(n))

if __name__ == '__main__':
    main()