#!/usr/bin/env python3
# ธีรภัทร์ นิลศิริ
# 640510662
# Lab 03
# Problem 2
# 204111 Sec 002

def reverse_digits(x):
    #แปลงเลขหลักหน่วยเป็นหลักพัน
    r0 = x%10 
    #แปลงเลขหลักสิบเป็นหลักร้อย
    r1 = (x//10)%10
    #แปลงเลขหลักร้อยเป็นหลักสิบ
    r2 = (x//100)%10
    #แปลงเลขหลักพันเป็นหลักหน่วย
    r3 = (x//1000)%10
    #แสดงค่าเลขกลับด้าน
    e_sus_2 = int('{0}{1}{2}{3}'.format(r0, r1, r2, r3))
    return e_sus_2

def main():
    # รับตัวเลขจาก user
    x = int(input())
    # พิมพ์ตัวเลขกลับด้าน
    print(reverse_digits(x))
    
if __name__ == '__main__':
    main()
